# Data models and relational SQL

So far we have seen how Python and Pandas are excellent tools for manipulating data but if we want to store this data long term then a DataFrame is not the best solution. What we need is a database.

After text files and spreadsheets, databases are perhaps the most common form of data storage that you will come across as a data scientist. 

So why are databases so important? One of their main advantages is that they can really handle data on a massive scale. Usually, this data is much larger than what can fit in the memory of a computer. So databases are made to work with data that is stored outside memory on a disc. A nice feature of databases is that the structure of the data is independent of the way that the data is stored on the disc. This means that we can change the way the data is stored without worrying about changing the actual programs that work with the data.

Now another main advantage of databases is that they allow very efficient and reliable storage and access to this data. This is due to the rigid structure of the data. A third property is that they are an extremely safe option for data storage due to their multiple built-in mechanisms that ensure the data will stay consistent regardless of external factors such as software or hardware failures. In fact, data stored in databases is intended to even outlive the programs that are run on it. One final advantage of databases is that multiple programs can operate on the same database since they have built-in concurrency systems that control how different users or applications can access the data.

#### The relational model

ne of the oldest and most common models for a database is the relational model. This is the model that is used by the vast majority of commercial database systems. The main components of a relational database are the following:

- relations (these are the tables)
- attributes (these are the columns of the tables)
- tuples (these are the rows of the tables)

Another use of the keys is to relate different relations of a database. Normally databases will have several relations in them. We can relate two relations of a database by linking their keys. There are three types of linking that we can perform

- one-to-one each key of the first relation relates to only one (or no) tuples in the related table.
- one-to-many each key of the first relation relates to none, one, or many tuples in the related table
- many-to-many each record in both tables can relate to any number of tuples (or no tuples) in the other table.

#### SQL

Once we have set up a schema and loaded some data into the database we can start to query this data and modify it. This is done using specific high-level languages. The advantage of using these high-level languages is that we can write our queries in a simple and compact format without really worrying about the algorithms behind which implement these queries.

Now there are many different choices for relational query languages. One of the most popular ones is SQL (pronounced "sequel" or "ess-que-el") which stands for Structured Query Language. It was first described in 1970 in Edgar F. Codds's 1970 paper "A Relational Model of Data for Large Shared Data Banks" and has been a standard for the American National Standards Institute since 1986. Since then it has become the language of choice for databases in most companies and commercial settings.

An important property of SQL is that it can be used with many different database systems such as Oracle, MySQL, Microsoft SQL Server, PostgreSQL, and SQLite to name a few.

#### SQLite

To work with databases in Python we must first choose a database system. There are many different systems available such as Oracle, MySQL, Microsoft SQL Server, PostgreSQL, and SQLite to name a few. They each have their own advantages and can be used for different purposes.

SQLite is what is known as an embedded or file-based database, while MySQL, Oracle, and PostgreSQL are server-based databases. Essentially each type of database is trying to solve a different problem. Embedded databases are great for small-scale applications and they run locally on your PC rather than a remote server. Each database is stored as a single file on disk. This makes them a great choice if you want to optimize economy, efficiency, independence, and simplicity. **Server-based databases, on the other hand, are better for larger and more complex data where you are interested in scalability, concurrency, centralization and control**

**In this course, we will focus on SQLite since it makes a great choice for an introduction to SQL. In addition, SQLite is already built into Python and we can use a special library to access the SQLite databases called sqlite3.**


In this unit, we will look at exploring our first database with some simple SQL queries. The database that we will work with is the SF Bay Area Bike Share from Kaggle. You can download the 'database.sqlite' file from the resources tab of this unit or the link

#### Connecting to the database

In [1]:
import pandas as pd
import sqlite3

In [2]:
db = sqlite3.connect('database.sqlite')

**The variable db is now a Connection object.** We can now use the pandas function read_sql_query to read the results of a SQL query on db directly into a pandas DataFrame. You will see that this is extremely convenient and useful.

**pd.read_sql_query("SQL query", db)**

In [3]:
def run_query(query):
    return pd.read_sql_query(query,db)

#### Fetching Data: SQL SELECT Queries

The most common keywords are the following:

- SELECT to mention which columns we want to be returned
- FROM to mention from which table
- LIMIT to mention how many rows we want to be returned
- WHERE to add one or more conditions that must be met by the selected data (i.e. for filtering the data)
- ORDER BY to sort the rows of the selected data

In [4]:
 run_query("SELECT tbl_name FROM sqlite_master;")

  tbl_name
0  station
1   status
2     trip
3  weather

In [5]:
 run_query("SELECT * FROM trip LIMIT 5;")

,id,duration,start_date,start_station_name,start_station_id,end_date,end_station_name,end_station_id,bike_id,subscription_type,zip_code
0,4069,174,8/29/2013 9:08,2nd at South Park,64,8/29/2013 9:11,2nd at South Park,64,288,Subscriber,94114
1,4073,1067,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:42,San Francisco Caltrain 2 (330 Townsend),69,321,Subscriber,94703
2,4074,1131,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,317,Subscriber,94115
3,4075,1117,8/29/2013 9:24,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,316,Subscriber,94122
4,4076,1118,8/29/2013 9:25,South Van Ness at Market,66,8/29/2013 9:43,San Francisco Caltrain 2 (330 Townsend),69,322,Subscriber,94597

In [6]:
 run_query("SELECT start_station_name, end_station_name, duration FROM trip LIMIT 5;")

         start_station_name                         end_station_name  duration
0         2nd at South Park                        2nd at South Park       174
1  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1067
2  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1131
3  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1117
4  South Van Ness at Market  San Francisco Caltrain 2 (330 Townsend)      1118

In [7]:
query = '''
SELECT start_station_name, end_station_name, duration FROM trip 
WHERE start_station_name = 'Paseo de San Antonio' 
LIMIT 5;
'''
run_query(query)

     start_station_name                   end_station_name  duration
0  Paseo de San Antonio                   Adobe on Almaden     12280
1  Paseo de San Antonio  San Jose Diridon Caltrain Station       454
2  Paseo de San Antonio               Paseo de San Antonio      1481
3  Paseo de San Antonio               Paseo de San Antonio      1475
4  Paseo de San Antonio  San Jose Diridon Caltrain Station       573

In [8]:
query='''
SELECT start_station_name, end_station_name, duration FROM trip 
WHERE duration<100 
LIMIT 5
'''
run_query(query)

         start_station_name          end_station_name  duration
0   Mountain View City Hall   Mountain View City Hall        71
1        San Jose City Hall        San Jose City Hall        77
2  South Van Ness at Market            Market at 10th        83
3  South Van Ness at Market  South Van Ness at Market        63
4        San Jose City Hall        San Jose City Hall        70

In [9]:
query='''
SELECT start_station_name, end_station_name, duration FROM trip 
WHERE (duration<100) AND (start_station_name = 'Paseo de San Antonio')
LIMIT 5;
'''
run_query(query)

     start_station_name      end_station_name  duration
0  Paseo de San Antonio  Paseo de San Antonio        87
1  Paseo de San Antonio  Paseo de San Antonio        69
2  Paseo de San Antonio  Paseo de San Antonio        94
3  Paseo de San Antonio  Paseo de San Antonio        82
4  Paseo de San Antonio  Paseo de San Antonio        65

ere are also a few additional operators that we can use with the **WHERE** keyword. For example **BETWEEN** lets us specify a range of values for a numerical column, and **IN** lets us specify a set of values.

One last keyword that we will look at is **ORDER BY**. Here we can include one or more column names that specify the sort order. By default, the order is ascending and if we want descending we must include the **DESC** keyword after the column name.

In [10]:
 query='''
SELECT start_station_name, end_station_name, duration FROM trip 
WHERE start_station_name = 'Paseo de San Antonio' 
ORDER BY duration DESC 
LIMIT 5;
'''
run_query(query)

     start_station_name        end_station_name  duration
0  Paseo de San Antonio               Japantown    288430
1  Paseo de San Antonio             MLK Library    167156
2  Paseo de San Antonio  SJSU 4th at San Carlos    127342
3  Paseo de San Antonio      San Jose City Hall     87387
4  Paseo de San Antonio      San Jose City Hall     87368

#### Aggregate funcions

In [11]:
run_query("SELECT AVG(duration) AS 'Average Duration' FROM trip;")

   Average Duration
0       1107.949846

In [12]:
query='''
SELECT subscription_type, AVG(duration) AS 'Average Duration'  FROM trip 
GROUP BY subscription_type;
'''
run_query(query)

  subscription_type  Average Duration
0          Customer       3951.761329
1        Subscriber        590.048856

#### **Join**

In [13]:
query = '''
SELECT station.city AS "City", COUNT(*) AS "Count"
FROM trip 
INNER JOIN station
ON trip.start_station_name = station.name
GROUP BY station.city
ORDER BY Count DESC;
'''
run_query(query)

            City   Count
0  San Francisco  592456
1       San Jose   37855
2  Mountain View   18167
3      Palo Alto    6773
4   Redwood City    3366

Great! And for one last challenge: suppose now that we wanted to find the duration of the longest intercity trip (the longest strip that starts and ends in different cities). Again we will have to work with the two tables trip and station but this time we are interested in obtaining the city of both the start station and the end station. This means that we need to join the trip table to the station table twice: the first for matching up trip.start_station_name with station.name and the second for matching up trip.end_station_name with station_name. To distinguish between the two views of the station table we will give each an alias name

In [14]:
query = '''
SELECT start.city AS "Start city", end.city AS "End city", trip.duration
FROM trip
INNER JOIN station AS start
ON trip.start_station_name = start.name
INNER JOIN station AS end
ON trip.end_station_name = end.name
WHERE start.city != end.city
ORDER BY duration DESC
LIMIT 1;
'''
run_query(query)

  Start city       End city  duration
0  Palo Alto  Mountain View    611240

#### Subqueries

Subqueries can be used to build queries on top of each other. Here is a basic example. Suppose we start with the following query which just selects the record that have duration less than 100

SELECT sub.*
FROM (SELECT * FROM trip
WHERE duration < 100) sub
WHERE start_station_name='Paseo de San Antonio';

 You will see some applications later on in an exercise where subqueries will indeed come in very handy. The important thing to remember when writing or reading subqueries is that the inner query inside the parentheses is executed first, and afterwards the outer query is run on the results returned by the inner one.

In [15]:
query = '''
SELECT trip.duration
FROM trip
ORDER BY trip.duration DESC
LIMIT 1;
'''
run_query(query)

   duration
0  17270400

In [16]:
query = '''
SELECT COUNT("id") as "Number of Trips" from trip
WHERE end_station_name = "2nd at South Park";
'''
run_query(query)

   Number of Trips
0            16843

In [17]:
query = '''
SELECT COUNT(*) from trip
WHERE duration BETWEEN 1000 AND 2000;
'''
run_query(query)

   COUNT(*)
0     56909

In [18]:
query = '''
SELECT bike_id, COUNT(*) as "Number of Trips", SUM(duration) as "Duration of trips" from trip
GROUP BY bike_id
ORDER BY COUNT("id") DESC
LIMIT 10;
'''
run_query(query)

   bike_id  Number of Trips  Duration of trips
0      392             2061            1789476
1      489             1975            1745818
2      558             1955            1729341
3      267             1951            1791746
4      631             1948            1829007
5      518             1942            2067178
6      532             1933            1701141
7      592             1932            1775589
8      395             1927            1870596
9      368             1926            1704566

In [19]:
query = '''
SELECT start_station_name, COUNT(*) as "Number of Trips", SUM(duration)  as "Duration of all trips" from trip
WHERE start_station_name = end_station_name
GROUP BY start_station_name
ORDER BY COUNT(*) DESC
LIMIT 5;
'''
run_query(query)

,start_station_name,Number of Trips,Duration of all trips
0,Embarcadero at Sansome,2092,9209028
1,Harry Bridges Plaza (Ferry Building),1733,10819388
2,University and Emerson,894,8264042
3,Market at 4th,724,6134989
4,2nd at Townsend,683,2142857

# Creating and modifying databases

In [24]:
db = sqlite3.connect("my_database.db")

Recall that this was the same command we used to open up a database or SQLite file. The command opens up the file if such a file exists and creates the file otherwise. So, in this case, it will create the file 'my_database.db' in your working directory.

**To actually create the tables we will have to write a query. We must mention the name of the table, and the names of each column followed by their data type. Here is an example**

In [25]:
query= "CREATE TABLE customer (id INTEGER PRIMARY KEY, first_name TEXT, last_name TEXT, age INTEGER);"

**Now to run this query we will show you a different way that does not rely on pandas read_sql_query** function. Instead, it works by creating a Cursor object from the Connect object db as follows

In [26]:
cursor = db.cursor()

In [27]:
cursor.execute(query)

OperationalError: table customer already exists

In [28]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")

**This should return the names of all the tables in our database. Except that now the results of the query are not automatically returned to us as when we used pandas.** We must run an additional command to get them. We can use the fetchall() method to get all the results of a query.

In [29]:
results = cursor.fetchall()
print(results)

[('customer',)]

#### Adding Rows

In [30]:
query = "INSERT INTO customer VALUES  (701, 'Mackenzie', 'Fox', 35)"
cursor.execute(query)

In [31]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35)]

#### Adding columns

In [32]:
cursor.execute("ALTER TABLE customer ADD COLUMN city TEXT DEFAULT 'Geneva';")
db.commit()

In [33]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva')]

#### Adding data from a pandas DataFrame

In [36]:
df2 = pd.DataFrame([[702, 'Emily', 'Joy', 49, 'Geneva']], columns=['id','first_name','last_name', 'age', 'city'])
df2.head()

    id first_name last_name  age    city
0  702      Emily       Joy   49  Geneva

***Aside*: We take this opportunity to point out a little trick when defining a DataFrame: we have usually defined DataFrames so far from Python dictionaries, but we can also do it by just passing a list of lists as seen above. This method has the advantage that we can be sure that the order of the columns will be the one we specified, whereas from a dictionary we have no control over the final order**

In [37]:
df2.to_sql(name='customer', con=db, if_exists='append', index=False)

The table customer already exists in this case and we have asked pandas to just append the data to this table. The argument index=False specifies to not include the index of the DataFrame as an actual column in the database, which would be the default setting.

In [38]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva'), (702, 'Emily', 'Joy', 49, 'Geneva')]

#### Updating rows

We can update any row in our database with a special SQL query that uses the UPDATE keyword. We must specify the name of the table we want to update to update and then pass the new values for each column that we want updated. We can specify which row we want the updates to apply to by using the WHERE statement that you have seen before.

Let's look at an example. Let's say we want to change the city of the customer Emily Joy in our table from Geneva to Zurich. We can identify this row using the id column. Our query then looks like this

In [40]:
update = '''
UPDATE customer
SET city='Zurich'
WHERE id=702;
'''

In [41]:
cursor.execute(update)
db.commit()

In [42]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva'), (702, 'Emily', 'Joy', 49, 'Zurich')]

#### Deleting rows

In [43]:
delete = '''
DELETE FROM customer
WHERE id=702;
'''
cursor.execute(delete)
db.commit()

In [45]:
cursor.execute("SELECT * FROM customer;")
results = cursor.fetchall()
print(results)

[(701, 'Mackenzie', 'Fox', 35, 'Geneva')]

#### Creating a database from a CSV file

The last thing that we will look at is creating a database from a csv file. Start by downloading the csv file songs.csv from the Resources tab and save it in your working directory.

Now, this csv file is very small just for the purposes of this demonstration. **However, when working with large csv files where we want to extract specific rows that satisfy some condition we must usually load the entire csv file as a DataFrame and then go through it line by line and check our condition.** All of this is happening in the working memory (RAM). And if the file is large then this can cause serious problems. In such instances, it is better to load the file as a database which is stored on the disk but is still easy and fast to interact with.

We can load csv files to a database using the to_sql() function from pandas once again. We must specify a connection object giving the database that we are connected to, so let's start by setting this up

In [46]:
db = sqlite3.connect('songs.db')
cursor= db.cursor()

In [54]:
for chunk in pd.read_csv("songs.csv", chunksize=4):    # une chanson sur 4
    chunk.to_sql(name="data", con=db, if_exists="append", index=False)  
    print(chunk.iloc[0, 2])

Stairway to Heaven
Black Dog
All My Love
Rebel Rebel
Golden Years

We have set up a for loop that reads 4 rows of the csv file at a time and loads them into a table called data of the database db. We have asked to print out the entry in the first row and third column of each chunk so you can see how the chunks were divided. What you should have gotten back when executing this command is

In [48]:
pd.read_sql_query('SELECT * FROM data;', db)

        Musician       Genre                        Name  Decade Minutes
0   Led Zeppelin   hard rock          Stairway to Heaven      70   08:02
1   Led Zeppelin   hard rock                     Kashmir      70   08:37
2   Led Zeppelin   hard rock              Immigrant Song      70   02:26
3   Led Zeppelin   hard rock            Whole Lotta Love      60   05:33
4   Led Zeppelin   hard rock                   Black Dog      70   04:55
5   Led Zeppelin   hard rock        Good Times Bad Times      60   02:43
6   Led Zeppelin   hard rock                   Moby Dick      60   04:25
7   Led Zeppelin   hard rock                   Ramble On      60   04:35
8   Led Zeppelin   hard rock                 All My Love      70   05:53
9   Led Zeppelin   hard rock  The Song Remains the Same       70   05:24
10  Led Zeppelin   hard rock       I Can't Quit You Baby      60   04:42
11   David Bowie    pop rock                Space Oddity      60   05:15
12   David Bowie    pop rock                 Rebel Rebel      70   04:22
13   David Bowie    pop rock              Under Pressure      80   04:08
14   David Bowie    pop rock                  China Girl      70   05:08
15   David Bowie    pop rock     I'm Afraid of Americans      90   05:00
16   David Bowie    pop rock                Golden Years      70   04:00
17     Bob Dylan  folk rock         Like a Rolling Stone      60   06:13
18     Bob Dylan  folk rock          Blowin' in the Wind      60   02:48
19     Bob Dylan  folk rock           Tangled Up in Blue      70   05:42

# Exercise : Consumer Finance Complaints

In this exercise, you will investigate a data set of consumer finance complaints. You can download the file consumer_complaints.csv from the Resources tab. The original data set is from Kaggle and can be found here.

The file contains information about 65499 complaints and has 12 columns

-' complaint_id'
- 'product'
- 'issue'
- 'company'
- 'state'
- 'zipcode',
- 'submitted_via'
- 'date_sent_to_company'
- 'date_received'
- 'company_response_to_consumer'
- 'timely_response'
- 'consumer_disputed?'

Here is a snapshot of the top entries

### Task 1
In the first part of this exercise, you will transfer the data from the csv file to a database. Count the number of records for each table to ensure that you loaded all the data. You should have 65499 records.

In [99]:
db = sqlite3.connect('consumer_complaints.db')
cursor= db.cursor()

In [100]:
for chunk in pd.read_csv("consumer_complaints.csv", chunksize =6500):
    chunk.to_sql(name="cons_complaints", con=db, if_exists="append", index=False)  
    print(chunk.iloc[0, 4])

CA
NC
CA
AR
VA
NY
MD
OH
CA
CA
CA

In [101]:
count_rows = '''
SELECT COUNT(*) FROM cons_complaints;
'''
cursor.execute(count_rows)
results = cursor.fetchall()
print(results)

[(65499,)]

### Task 2 

Run an SQL query to return a DataFrame containing a unique list of submission methods for the complaints together with the number of complaints submitted via each method. Your output should look like this.

In [102]:
df_method = pd.read_sql_query('SELECT submitted_via as Method, COUNT(*) as Number FROM cons_complaints GROUP BY Method ORDER BY Number DESC;', db)
df_method

        Method  Number
0          Web   43947
1     Referral   10587
2        Phone    4974
3  Postal mail    4894
4          Fax    1076
5        Email      21

### Task 3 

Build upon your SQL query from part 2 to return a third column in your DataFrame containing the total number of complaints (each row should contain the same number). Your output should look like this

In [103]:
for row in df_method.index:
    df_method['Total'] = pd.read_sql_query('SELECT COUNT(*) as Number FROM data_songs;', db)

df_method

# pas russi  le faire sur chaque ligne

        Method  Number    Total
0          Web   43947  65499.0
1     Referral   10587      NaN
2        Phone    4974      NaN
3  Postal mail    4894      NaN
4          Fax    1076      NaN
5        Email      21      NaN

query='''
SELECT submitted_via AS 'Method', COUNT(*) AS 'Number',
   (SELECT COUNT(*) FROM cons_complaints) AS 'Total'
FROM cons_complaints
GROUP BY submitted_via
ORDER BY COUNT(*) DESC;
'''
run_query(query)

In [104]:
df_method2 = pd.read_sql_query('SELECT submitted_via AS Method, COUNT(*) AS Number,(SELECT COUNT(*) FROM cons_complaints) AS Total FROM cons_complaints GROUP BY submitted_via ORDER BY COUNT(*) DESC;', db)

In [105]:
df_method2

        Method  Number  Total
0          Web   43947  65499
1     Referral   10587  65499
2        Phone    4974  65499
3  Postal mail    4894  65499
4          Fax    1076  65499
5        Email      21  65499

### Task 4
Build upon your query from part 3 to add a column which gives the percentage of total complaints submitted via each of the methods. Your output should look like this

In [109]:
## df_method2 = pd.read_sql_query('SELECT submitted_via AS Method, COUNT(*) AS Number,(SELECT COUNT(*) FROM cons_complaints) AS Total, CAST(Number as double precision)/CAST(Total as double precision)*100 as Percent FROM cons_complaints GROUP BY submitted_via ORDER BY COUNT(*) DESC;', db)


# pas russi... utiliser CAST ET SUBQUERIES

In [110]:
query='''

SELECT *, (CAST (q1.Number AS double precision)/CAST (q1.Total AS double precision))*100 AS 'Percent'
FROM (SELECT submitted_via AS 'Method', COUNT(*) AS 'Number',
   (SELECT COUNT(*) FROM cons_complaints) AS 'Total'
FROM cons_complaints
GROUP BY submitted_via
ORDER BY COUNT(*) DESC) q1;
'''
run_query(query)

        Method  Number  Total    Percent
0          Web   43947  65499  67.095681
1     Referral   10587  65499  16.163606
2        Phone    4974  65499   7.594009
3  Postal mail    4894  65499   7.471870
4          Fax    1076  65499   1.642773
5        Email      21  65499   0.032062

In [113]:
## AUTRE SOLUTION



query='''

WITH task_3_output AS (
    SELECT submitted_via AS 'Method', 
           COUNT(*) AS 'Number',
           (SELECT COUNT(*) FROM cons_complaints) AS 'Total'
    FROM cons_complaints
    GROUP BY submitted_via
    ORDER BY COUNT(*) DESC
)

SELECT *, 
       (CAST (task_3_output.Number AS double precision)/CAST (task_3_output.Total AS double precision))*100 AS 'Percent'
FROM task_3_output;
'''
run_query(query)

        Method  Number  Total    Percent
0          Web   43947  65499  67.095681
1     Referral   10587  65499  16.163606
2        Phone    4974  65499   7.594009
3  Postal mail    4894  65499   7.471870
4          Fax    1076  65499   1.642773
5        Email      21  65499   0.032062